---
type: AnalysisDisplayMarkersAndTextSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 10
tags: [revit-api, class]
---

# AnalysisDisplayMarkersAndTextSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayMarkersAndTextSettings | — | `` |
| Constructor | AnalysisDisplayMarkersAndTextSettings | 2011 | `public AnalysisDisplayMarkersAndTextSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( AnalysisDisplayMarkersAndTextSettings other )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MarkerSize | 2011 | `public double MarkerSize { get ; set ; }` |
| Property | MarkerType | 2011 | `public AnalysisDisplayStyleMarkerType MarkerType { get ; set ; }` |
| Property | Rounding | 2011 | `public double Rounding { get ; set ; }` |
| Property | TextLabelType | 2011 | `public AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get ; set ; }` |
| Property | TextTypeId | 2011 | `public ElementId TextTypeId { get ; set ; }` |